# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)


# Ввод: [-1, 4, 3, 2, -1, -3, 4, 10, -4, 2, 3, 0, -2, 4, 1, -9, 2, -5, -1, 6]

list_1 = [-1, 4, 3, 2, -1, -3, 4, 10, -4, 2, 3, 0, -2, 4, 1, -9, 2, -5, -1, 6]
list_2 = []
max = 10
min = 6
# for i in range(len(lst_1)):
#     if list_1[i] >= min and list_1[i] <= max:
#         list_2.append(i)
# print(list_2)
# или
for i in range(len(list_1)):
    if min <= list_1[i] <= max:
        print(i, end=' ')

# Вывод: [7, 19]